" ==============================================================================
" === Anobisoft Vim Configuration                                            ===
" ==============================================================================

" --- 1. Подсветка и синтаксис ---
" Включение подсветки синтаксиса
syntax on

" --- 2. Настройка отступов и выравнивания ---
" Задаем ширину таба в 4 пробела, заменяем табы на пробелы и включаем умные отступы
set tabstop=4 shiftwidth=4 expandtab smarttab

" Включение автоматического отступа для новых строк на основе предыдущей (autoindent)
set ai

" --- 3. Совместимость и поведение клавиш ---
" Отключение обратной совместимости со старым Vi для активации современных фич Vim
set nocompatible

" Разрешает использовать клавишу Backspace для удаления отступов, переносов строк и символов до начала вставки
set backspace=indent,eol,start

" Отключение поддержки мыши. Позволяет выделять и копировать текст силами самого терминала, как вы привыкли
set mouse=

" --- 4. Интерфейс и поиск ---
" Подсвечивает совпадения при поиске через '/'
set hlsearch

" Включаем визуальное интерактивное меню автодополнения команд в статус-баре
set wildmenu

" Отображает текущую позицию курсора (строка и колонка) в правом нижнем углу экрана
set ruler

" Автоматически перечитывать файл, если он был изменен извне (например, гит-пулом)
set autoread

" Скрывать дефолтный индикатор режима (-- INSERT --) в самом низу, так как он дублирует статус-бар
" set noshowmode

" Игнорировать регистр при поиске, если все буквы строчные, и учитывать его, если появилась заглавная
set ignorecase smartcase
